0. 所有的题目结果中，给出SQL语句和执行结果。

1. 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)，数据如下：

    ('John Doe', 'Male', 25, '123-456-7890')

    ('Jane Smith', 'Female', 31, '987-654-3210')
    
    ('Bob Johnson', 'Male', 22, '555-123-4567')

In [5]:
import pymysql
   # 建立连接
connection = pymysql.connect(
    host='localhost',  # 主机地址，本地通常为localhost
    user='root',       # 用户名
    password='Tp123123',  # 密码
    database='user'   # 数据库名称
)

In [45]:
#删除表格
try:
    cursor = connection.cursor()
    # 获取数据库中的所有表名
    cursor.execute("SHOW TABLES")
    tables = cursor.fetchall()
    for table in tables:
        table_name = table[0]
        # 删除表的 SQL 语句
        drop_table_sql = f"DROP TABLE {table_name}"
        cursor.execute(drop_table_sql)
    connection.commit()
    print("所有表已成功删除。")
except Exception as e:
    connection.rollback()
    print(f"发生错误：{e}")

所有表已成功删除。

In [46]:
#创建游标
cursor = connection.cursor()
#创建表
create_table_query = """
CREATE TABLE user (
   id INT AUTO_INCREMENT PRIMARY KEY,
   name VARCHAR(255) NOT NULL,
   sex ENUM('Male', 'Female') NOT NULL,
   age INT NOT NULL,
   phone VARCHAR(20) NOT NULL
)
"""
cursor.execute(create_table_query)
#插入数据
insert_data_query = """
INSERT INTO user (name, sex, age, phone) VALUES
   (%s, %s, %s, %s)
"""
data = [
   ('John Doe', 'Male', 25, '123-456-7890'),
   ('Jane Smith', 'Female', 31, '987-654-3210'),
   ('Bob Johnson', 'Male', 22, '555-123-4567')
]

cursor.executemany(insert_data_query, data)
connection.commit()

In [47]:
#查询全部数据
select_query = "SELECT * FROM user"
cursor.execute(select_query)
results = cursor.fetchall()
for row in results:
   print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')

2. 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户

In [19]:
sql="""
SELECT *
FROM user
Where age>=20 AND age<=30
"""
cursor.execute(sql)
results = cursor.fetchall()
for row in results:
   print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')

3. 写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。

In [48]:
sql="""
   INSERT INTO user (name, sex, age, phone)
   VALUES ('Han Yue', 'Female', 20, '12312345678');
"""
cursor.execute(sql)
#输出全部数据
select_query = "SELECT * FROM user"
cursor.execute(select_query)
results = cursor.fetchall()
for row in results:
   print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Han Yue', 'Female', 20, '12312345678')

In [49]:
#插入数据
insert_data_query = """
INSERT INTO user (name, sex, age, phone) VALUES
   (%s, %s, %s, %s)
"""
data = [
   ('Han Yue', 'Male', 15, '123-456-7890'),
   ('Han Yue', 'Female', 18, '137-654-3210'),
   ('Han Yue', 'Male', 22, '195-123-4567')
]

cursor.executemany(insert_data_query, data)
connection.commit()

In [22]:
#查询当前数据库的全部数据
sql="""
SELECT *
FROM user
"""
cursor.execute(sql)
results = cursor.fetchall()
for row in results:
   print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Han Yue', 'Female', 20, '12312345678')
(5, 'HanYue', 'Male', 15, '123-456-7890')
(6, 'HanYue', 'Female', 18, '137-654-3210')
(7, 'HanYue', 'Male', 22, '195-123-4567')

4. 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出

In [25]:
sql='''
SELECT *
From user
Where user.name LIKE '%Han%'  AND age Between 20 AND 30
Order By age desc
'''
cursor.execute(sql)
results = cursor.fetchall()
for row in results:
   print(row)

(7, 'HanYue', 'Male', 22, '195-123-4567')
(4, 'Han Yue', 'Female', 20, '12312345678')

5. 写出 SQL 语句,计算 user 表中所有用户的平均年龄

In [35]:
sql ='''
Select avg(age)
From user;
'''
cursor.execute(sql)
results= cursor.fetchall()
for row in results:
    print(row)

(Decimal('21.8571'),)

6. 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键

In [50]:
sql1 = """
CREATE TABLE team (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamName VARCHAR(255)
);
"""
sql2='''
CREATE TABLE score (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES user(id)
);
'''
cursor.execute(sql1)
cursor.execute(sql2)

0

In [38]:
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for table in tables:
    table_name = table[0]
    print(table_name)

score
team
user

7. 在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。

In [51]:
sql1='''
Insert into team (teamName) Values
(%s)
'''
data1=[
    ("ECNU"),
    ("开心鸭"),
    ("Go"),
    ("Yeah")
]

cursor.executemany(sql1,data1)

4

In [52]:
sql2='''
Insert into score (teamid,userid,score) Values
(%s,%s,%s)
'''
data2=[
    (1,1,80),
    (2,2,75),
    (3,3,68),
    (4,4,92)
]
cursor.executemany(sql2,data2)

4

In [53]:
sql ='''
Select *
From team;
'''
cursor.execute(sql)
results= cursor.fetchall()
for row in results:
    print(row)

(1, 'ECNU')
(2, '开心鸭')
(3, 'Go')
(4, 'Yeah')

In [54]:
sql ='''
Select *
From score;
'''
cursor.execute(sql)
results= cursor.fetchall()
for row in results:
    print(row)

(1, 1, 1, 80)
(2, 2, 2, 75)
(3, 3, 3, 68)
(4, 4, 4, 92)

8. 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

In [55]:
#使第5、6、7位用户也加入ECNU队
sql2='''
Insert into score (teamid,userid,score) Values
(%s,%s,%s)
'''
data2=[
    (1,5,65),
    (1,6,99),
    (1,7,92)
]
cursor.executemany(sql2,data2)

3

In [56]:
sql ='''
Select sum(score)
From score,team
Where score.teamid=team.id AND team.teamName='ECNU'
'''
cursor.execute(sql)
results= cursor.fetchall()
for row in results:
    print(row)

(Decimal('336'),)

9. 写出SQL语句，删除user表中个人信息的记录。

In [60]:
# 先删除 score 表中相关的记录
delete_score_sql = "DELETE FROM score WHERE userid = %s"
user_id_to_delete = (1,)  # 假设要删除 id 为 1 的用户

cursor.execute(delete_score_sql, user_id_to_delete)

# 然后删除 user 表中该用户的记录
delete_user_sql = "DELETE FROM user WHERE id = %s"
cursor.execute(delete_user_sql, user_id_to_delete)

0

In [61]:
sql ='''
Select *
From user
'''
cursor.execute(sql)
results= cursor.fetchall()
for row in results:
    print(row)

(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Han Yue', 'Female', 20, '12312345678')
(5, 'Han Yue', 'Male', 15, '123-456-7890')
(6, 'Han Yue', 'Female', 18, '137-654-3210')
(7, 'Han Yue', 'Male', 22, '195-123-4567')

发现id 为 1 的用户在user表中的个人信息已删除。